import React from "react";
import styles from "./profileTable.module.css";
import CardComponent from "../../../components/cardComponent";

export default function ProfileTable({setRemove}) {
  return (
    <CardComponent>
      <div className={styles.profile_table_title}>Активные сеансы</div>
      <div className={styles.profile_table_data}>
        <div className={styles.profile_table_header}>
          <div>Устройство</div>
          <div>Локация</div>
          <div>Дата</div>
        </div>
        <div className={styles.profile_table}>
          <div className={styles.profile_table_item}>
            <div className={styles.profile_table_item_name}>
              <svg
                width="30"
                height="30"
                viewBox="0 0 30 30"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clipPath="url(#clip0_1568_16709)">
                  <rect width="30" height="30" rx="15" fill="#EEEEEE" />
                  <g clipPath="url(#clip1_1568_16709)">
                    <path
                      d="M11.5125 5.01248C11.4609 5.02186 11.4078 5.03123 11.3625 5.06248C11.1797 5.18592 11.1391 5.44217 11.2625 5.62498L12.125 6.91248C10.7922 7.61873 9.79844 8.79217 9.475 10.2H20.525C20.2016 8.79217 19.2078 7.61873 17.875 6.91248L18.7375 5.62498C18.8609 5.44217 18.8203 5.18592 18.6375 5.06248C18.4531 4.93905 18.1984 4.99217 18.075 5.17498L17.125 6.57498C16.4656 6.33436 15.75 6.19998 15 6.19998C14.25 6.19998 13.5344 6.33436 12.875 6.57498L11.925 5.17498C11.8328 5.03748 11.6656 4.9828 11.5125 5.01248ZM12.8 8.19998C13.1312 8.19998 13.4 8.46873 13.4 8.79998C13.4 9.1328 13.1312 9.39998 12.8 9.39998C12.4672 9.39998 12.2 9.1328 12.2 8.79998C12.2 8.46873 12.4672 8.19998 12.8 8.19998ZM17.2 8.19998C17.5328 8.19998 17.8 8.46873 17.8 8.79998C17.8 9.1328 17.5328 9.39998 17.2 9.39998C16.8688 9.39998 16.6 9.1328 16.6 8.79998C16.6 8.46873 16.8688 8.19998 17.2 8.19998ZM8.2 11C7.5375 11 7 11.5375 7 12.2V17.8C7 18.4625 7.5375 19 8.2 19C8.34063 19 8.475 18.9703 8.6 18.925V11.075C8.475 11.0297 8.34063 11 8.2 11ZM9.4 11V19.8C9.4 20.4609 9.93906 21 10.6 21H19.4C20.0609 21 20.6 20.4609 20.6 19.8V11H9.4ZM21.8 11C21.6594 11 21.525 11.0297 21.4 11.075V18.925C21.525 18.9687 21.6594 19 21.8 19C22.4625 19 23 18.4625 23 17.8V12.2C23 11.5375 22.4625 11 21.8 11ZM11 21.8V23.4C11 24.2828 11.7172 25 12.6 25C13.4828 25 14.2 24.2828 14.2 23.4V21.8H11ZM15.8 21.8V23.4C15.8 24.2828 16.5172 25 17.4 25C18.2828 25 19 24.2828 19 23.4V21.8H15.8Z"
                      fill="#A5A1A1"
                    />
                  </g>
                </g>
                <defs>
                  <clipPath id="clip0_1568_16709">
                    <rect width="30" height="30" fill="white" />
                  </clipPath>
                  <clipPath id="clip1_1568_16709">
                    <rect
                      width="20"
                      height="20"
                      fill="white"
                      transform="translate(5 5)"
                    />
                  </clipPath>
                </defs>
              </svg>
              X555EA
            </div>
            <div>Tashkent, Uzbekistan</div>
            <div className={styles.profile_table_item_date}>
              <div className={styles.profile_table_item_date_nums}>
                <h3>05.06.23</h3>
                <span></span>
                <p>14:44</p>
              </div>
              <div className={styles.profile_table_item_remove} onClick={() => setRemove(true)}>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M6.46077 6L6 6.46077L11.5392 12L6 17.5392L6.46077 18L12 12.4608L17.5392 18L18 17.5392L12.4608 12L18 6.46077L17.5392 6L12 11.5392L6.46077 6Z"
                    fill="#342C2C"
                  />
                </svg>
              </div>
            </div>
          </div>
          <div className={styles.profile_table_item}>
            <div className={styles.profile_table_item_name}>
              <svg
                width="30"
                height="30"
                viewBox="0 0 30 30"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clipPath="url(#clip0_1568_16709)">
                  <rect width="30" height="30" rx="15" fill="#EEEEEE" />
                  <g clipPath="url(#clip1_1568_16709)">
                    <path
                      d="M11.5125 5.01248C11.4609 5.02186 11.4078 5.03123 11.3625 5.06248C11.1797 5.18592 11.1391 5.44217 11.2625 5.62498L12.125 6.91248C10.7922 7.61873 9.79844 8.79217 9.475 10.2H20.525C20.2016 8.79217 19.2078 7.61873 17.875 6.91248L18.7375 5.62498C18.8609 5.44217 18.8203 5.18592 18.6375 5.06248C18.4531 4.93905 18.1984 4.99217 18.075 5.17498L17.125 6.57498C16.4656 6.33436 15.75 6.19998 15 6.19998C14.25 6.19998 13.5344 6.33436 12.875 6.57498L11.925 5.17498C11.8328 5.03748 11.6656 4.9828 11.5125 5.01248ZM12.8 8.19998C13.1312 8.19998 13.4 8.46873 13.4 8.79998C13.4 9.1328 13.1312 9.39998 12.8 9.39998C12.4672 9.39998 12.2 9.1328 12.2 8.79998C12.2 8.46873 12.4672 8.19998 12.8 8.19998ZM17.2 8.19998C17.5328 8.19998 17.8 8.46873 17.8 8.79998C17.8 9.1328 17.5328 9.39998 17.2 9.39998C16.8688 9.39998 16.6 9.1328 16.6 8.79998C16.6 8.46873 16.8688 8.19998 17.2 8.19998ZM8.2 11C7.5375 11 7 11.5375 7 12.2V17.8C7 18.4625 7.5375 19 8.2 19C8.34063 19 8.475 18.9703 8.6 18.925V11.075C8.475 11.0297 8.34063 11 8.2 11ZM9.4 11V19.8C9.4 20.4609 9.93906 21 10.6 21H19.4C20.0609 21 20.6 20.4609 20.6 19.8V11H9.4ZM21.8 11C21.6594 11 21.525 11.0297 21.4 11.075V18.925C21.525 18.9687 21.6594 19 21.8 19C22.4625 19 23 18.4625 23 17.8V12.2C23 11.5375 22.4625 11 21.8 11ZM11 21.8V23.4C11 24.2828 11.7172 25 12.6 25C13.4828 25 14.2 24.2828 14.2 23.4V21.8H11ZM15.8 21.8V23.4C15.8 24.2828 16.5172 25 17.4 25C18.2828 25 19 24.2828 19 23.4V21.8H15.8Z"
                      fill="#A5A1A1"
                    />
                  </g>
                </g>
                <defs>
                  <clipPath id="clip0_1568_16709">
                    <rect width="30" height="30" fill="white" />
                  </clipPath>
                  <clipPath id="clip1_1568_16709">
                    <rect
                      width="20"
                      height="20"
                      fill="white"
                      transform="translate(5 5)"
                    />
                  </clipPath>
                </defs>
              </svg>
              X555EA
            </div>
            <div>Tashkent, Uzbekistan</div>
            <div className={styles.profile_table_item_date}>
              <div className={styles.profile_table_item_date_nums}>
                <h3>05.06.23</h3>
                <span></span>
                <p>14:44</p>
              </div>
              <div className={styles.profile_table_item_remove} onClick={() => setRemove(true)}>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M6.46077 6L6 6.46077L11.5392 12L6 17.5392L6.46077 18L12 12.4608L17.5392 18L18 17.5392L12.4608 12L18 6.46077L17.5392 6L12 11.5392L6.46077 6Z"
                    fill="#342C2C"
                  />
                </svg>
              </div>
            </div>
          </div>
          <div className={styles.profile_table_item}>
            <div className={styles.profile_table_item_name}>
              <svg
                width="30"
                height="30"
                viewBox="0 0 30 30"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clipPath="url(#clip0_1568_16709)">
                  <rect width="30" height="30" rx="15" fill="#EEEEEE" />
                  <g clipPath="url(#clip1_1568_16709)">
                    <path
                      d="M11.5125 5.01248C11.4609 5.02186 11.4078 5.03123 11.3625 5.06248C11.1797 5.18592 11.1391 5.44217 11.2625 5.62498L12.125 6.91248C10.7922 7.61873 9.79844 8.79217 9.475 10.2H20.525C20.2016 8.79217 19.2078 7.61873 17.875 6.91248L18.7375 5.62498C18.8609 5.44217 18.8203 5.18592 18.6375 5.06248C18.4531 4.93905 18.1984 4.99217 18.075 5.17498L17.125 6.57498C16.4656 6.33436 15.75 6.19998 15 6.19998C14.25 6.19998 13.5344 6.33436 12.875 6.57498L11.925 5.17498C11.8328 5.03748 11.6656 4.9828 11.5125 5.01248ZM12.8 8.19998C13.1312 8.19998 13.4 8.46873 13.4 8.79998C13.4 9.1328 13.1312 9.39998 12.8 9.39998C12.4672 9.39998 12.2 9.1328 12.2 8.79998C12.2 8.46873 12.4672 8.19998 12.8 8.19998ZM17.2 8.19998C17.5328 8.19998 17.8 8.46873 17.8 8.79998C17.8 9.1328 17.5328 9.39998 17.2 9.39998C16.8688 9.39998 16.6 9.1328 16.6 8.79998C16.6 8.46873 16.8688 8.19998 17.2 8.19998ZM8.2 11C7.5375 11 7 11.5375 7 12.2V17.8C7 18.4625 7.5375 19 8.2 19C8.34063 19 8.475 18.9703 8.6 18.925V11.075C8.475 11.0297 8.34063 11 8.2 11ZM9.4 11V19.8C9.4 20.4609 9.93906 21 10.6 21H19.4C20.0609 21 20.6 20.4609 20.6 19.8V11H9.4ZM21.8 11C21.6594 11 21.525 11.0297 21.4 11.075V18.925C21.525 18.9687 21.6594 19 21.8 19C22.4625 19 23 18.4625 23 17.8V12.2C23 11.5375 22.4625 11 21.8 11ZM11 21.8V23.4C11 24.2828 11.7172 25 12.6 25C13.4828 25 14.2 24.2828 14.2 23.4V21.8H11ZM15.8 21.8V23.4C15.8 24.2828 16.5172 25 17.4 25C18.2828 25 19 24.2828 19 23.4V21.8H15.8Z"
                      fill="#A5A1A1"
                    />
                  </g>
                </g>
                <defs>
                  <clipPath id="clip0_1568_16709">
                    <rect width="30" height="30" fill="white" />
                  </clipPath>
                  <clipPath id="clip1_1568_16709">
                    <rect
                      width="20"
                      height="20"
                      fill="white"
                      transform="translate(5 5)"
                    />
                  </clipPath>
                </defs>
              </svg>
              X555EA
            </div>
            <div>Tashkent, Uzbekistan</div>
            <div className={styles.profile_table_item_date}>
              <div className={styles.profile_table_item_date_nums}>
                <h3>05.06.23</h3>
                <span></span>
                <p>14:44</p>
              </div>
              <div className={styles.profile_table_item_remove} onClick={() => setRemove(true)}>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M6.46077 6L6 6.46077L11.5392 12L6 17.5392L6.46077 18L12 12.4608L17.5392 18L18 17.5392L12.4608 12L18 6.46077L17.5392 6L12 11.5392L6.46077 6Z"
                    fill="#342C2C"
                  />
                </svg>
              </div>
            </div>
          </div>
          <div className={styles.profile_table_item}>
            <div className={styles.profile_table_item_name}>
              <svg
                width="30"
                height="30"
                viewBox="0 0 30 30"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clipPath="url(#clip0_1568_16709)">
                  <rect width="30" height="30" rx="15" fill="#EEEEEE" />
                  <g clipPath="url(#clip1_1568_16709)">
                    <path
                      d="M11.5125 5.01248C11.4609 5.02186 11.4078 5.03123 11.3625 5.06248C11.1797 5.18592 11.1391 5.44217 11.2625 5.62498L12.125 6.91248C10.7922 7.61873 9.79844 8.79217 9.475 10.2H20.525C20.2016 8.79217 19.2078 7.61873 17.875 6.91248L18.7375 5.62498C18.8609 5.44217 18.8203 5.18592 18.6375 5.06248C18.4531 4.93905 18.1984 4.99217 18.075 5.17498L17.125 6.57498C16.4656 6.33436 15.75 6.19998 15 6.19998C14.25 6.19998 13.5344 6.33436 12.875 6.57498L11.925 5.17498C11.8328 5.03748 11.6656 4.9828 11.5125 5.01248ZM12.8 8.19998C13.1312 8.19998 13.4 8.46873 13.4 8.79998C13.4 9.1328 13.1312 9.39998 12.8 9.39998C12.4672 9.39998 12.2 9.1328 12.2 8.79998C12.2 8.46873 12.4672 8.19998 12.8 8.19998ZM17.2 8.19998C17.5328 8.19998 17.8 8.46873 17.8 8.79998C17.8 9.1328 17.5328 9.39998 17.2 9.39998C16.8688 9.39998 16.6 9.1328 16.6 8.79998C16.6 8.46873 16.8688 8.19998 17.2 8.19998ZM8.2 11C7.5375 11 7 11.5375 7 12.2V17.8C7 18.4625 7.5375 19 8.2 19C8.34063 19 8.475 18.9703 8.6 18.925V11.075C8.475 11.0297 8.34063 11 8.2 11ZM9.4 11V19.8C9.4 20.4609 9.93906 21 10.6 21H19.4C20.0609 21 20.6 20.4609 20.6 19.8V11H9.4ZM21.8 11C21.6594 11 21.525 11.0297 21.4 11.075V18.925C21.525 18.9687 21.6594 19 21.8 19C22.4625 19 23 18.4625 23 17.8V12.2C23 11.5375 22.4625 11 21.8 11ZM11 21.8V23.4C11 24.2828 11.7172 25 12.6 25C13.4828 25 14.2 24.2828 14.2 23.4V21.8H11ZM15.8 21.8V23.4C15.8 24.2828 16.5172 25 17.4 25C18.2828 25 19 24.2828 19 23.4V21.8H15.8Z"
                      fill="#A5A1A1"
                    />
                  </g>
                </g>
                <defs>
                  <clipPath id="clip0_1568_16709">
                    <rect width="30" height="30" fill="white" />
                  </clipPath>
                  <clipPath id="clip1_1568_16709">
                    <rect
                      width="20"
                      height="20"
                      fill="white"
                      transform="translate(5 5)"
                    />
                  </clipPath>
                </defs>
              </svg>
              X555EA
            </div>
            <div>Tashkent, Uzbekistan</div>
            <div className={styles.profile_table_item_date}>
              <div className={styles.profile_table_item_date_nums}>
                <h3>05.06.23</h3>
                <span></span>
                <p>14:44</p>
              </div>
              <div className={styles.profile_table_item_remove} onClick={() => setRemove(true)}>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M6.46077 6L6 6.46077L11.5392 12L6 17.5392L6.46077 18L12 12.4608L17.5392 18L18 17.5392L12.4608 12L18 6.46077L17.5392 6L12 11.5392L6.46077 6Z"
                    fill="#342C2C"
                  />
                </svg>
              </div>
            </div>
          </div>
          <div className={styles.profile_table_item}>
            <div className={styles.profile_table_item_name}>
              <svg
                width="30"
                height="30"
                viewBox="0 0 30 30"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clipPath="url(#clip0_1568_16709)">
                  <rect width="30" height="30" rx="15" fill="#EEEEEE" />
                  <g clipPath="url(#clip1_1568_16709)">
                    <path
                      d="M11.5125 5.01248C11.4609 5.02186 11.4078 5.03123 11.3625 5.06248C11.1797 5.18592 11.1391 5.44217 11.2625 5.62498L12.125 6.91248C10.7922 7.61873 9.79844 8.79217 9.475 10.2H20.525C20.2016 8.79217 19.2078 7.61873 17.875 6.91248L18.7375 5.62498C18.8609 5.44217 18.8203 5.18592 18.6375 5.06248C18.4531 4.93905 18.1984 4.99217 18.075 5.17498L17.125 6.57498C16.4656 6.33436 15.75 6.19998 15 6.19998C14.25 6.19998 13.5344 6.33436 12.875 6.57498L11.925 5.17498C11.8328 5.03748 11.6656 4.9828 11.5125 5.01248ZM12.8 8.19998C13.1312 8.19998 13.4 8.46873 13.4 8.79998C13.4 9.1328 13.1312 9.39998 12.8 9.39998C12.4672 9.39998 12.2 9.1328 12.2 8.79998C12.2 8.46873 12.4672 8.19998 12.8 8.19998ZM17.2 8.19998C17.5328 8.19998 17.8 8.46873 17.8 8.79998C17.8 9.1328 17.5328 9.39998 17.2 9.39998C16.8688 9.39998 16.6 9.1328 16.6 8.79998C16.6 8.46873 16.8688 8.19998 17.2 8.19998ZM8.2 11C7.5375 11 7 11.5375 7 12.2V17.8C7 18.4625 7.5375 19 8.2 19C8.34063 19 8.475 18.9703 8.6 18.925V11.075C8.475 11.0297 8.34063 11 8.2 11ZM9.4 11V19.8C9.4 20.4609 9.93906 21 10.6 21H19.4C20.0609 21 20.6 20.4609 20.6 19.8V11H9.4ZM21.8 11C21.6594 11 21.525 11.0297 21.4 11.075V18.925C21.525 18.9687 21.6594 19 21.8 19C22.4625 19 23 18.4625 23 17.8V12.2C23 11.5375 22.4625 11 21.8 11ZM11 21.8V23.4C11 24.2828 11.7172 25 12.6 25C13.4828 25 14.2 24.2828 14.2 23.4V21.8H11ZM15.8 21.8V23.4C15.8 24.2828 16.5172 25 17.4 25C18.2828 25 19 24.2828 19 23.4V21.8H15.8Z"
                      fill="#A5A1A1"
                    />
                  </g>
                </g>
                <defs>
                  <clipPath id="clip0_1568_16709">
                    <rect width="30" height="30" fill="white" />
                  </clipPath>
                  <clipPath id="clip1_1568_16709">
                    <rect
                      width="20"
                      height="20"
                      fill="white"
                      transform="translate(5 5)"
                    />
                  </clipPath>
                </defs>
              </svg>
              X555EA
            </div>
            <div>Tashkent, Uzbekistan</div>
            <div className={styles.profile_table_item_date}>
              <div className={styles.profile_table_item_date_nums}>
                <h3>05.06.23</h3>
                <span></span>
                <p>14:44</p>
              </div>
              <div className={styles.profile_table_item_remove} onClick={() => setRemove(true)}>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M6.46077 6L6 6.46077L11.5392 12L6 17.5392L6.46077 18L12 12.4608L17.5392 18L18 17.5392L12.4608 12L18 6.46077L17.5392 6L12 11.5392L6.46077 6Z"
                    fill="#342C2C"
                  />
                </svg>
              </div>
            </div>
          </div>
        </div>
      </div>
    </CardComponent>
  );
}
