import React, { useState } from "react";
import styles from "./documentTable.module.css";

export default function DocumentTable() {
  const [activeRow, setActiveRow] = useState("empty");

  return (
    <div className={styles.table}>
      <div className={styles.table_header}>
        <div className={styles.table_header_date}>Дата, время</div>
        <div>Контрагент</div>
        <div>Документ</div>
        <div>Исполнитель</div>
        <div>Статус</div>
      </div>
      <div className={styles.table_data}>
        <div
          className={`${styles.table_data_item} ${
            activeRow == 1 && styles.table_data_item_active
          }`}
        >
          <div className={styles.table_data_item_main}>
            <div className={styles.table_data_item_main_date}>
              <div className={styles.table_data_item_main_date_icon}>
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 30 30"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clipPath="url(#clip0_1692_14495)">
                    <rect
                      width="30"
                      height="30"
                      rx="15"
                      fill="#EEEEEE"
                      fillOpacity="0.6"
                    />
                    <g clipPath="url(#clip1_1692_14495)">
                      <path
                        d="M7.80078 5.79999V24.2H12.3219C12.2447 24.0124 12.2008 23.8132 12.2008 23.6V20.4C12.2008 19.0636 13.7708 18.2 16.2008 18.2C16.814 18.2 17.3717 18.2554 17.8641 18.3594C18.1753 17.2774 19.65 16.6 21.8008 16.6C21.9372 16.6 22.07 16.6038 22.2008 16.6094V10.8344L17.1664 5.79999H7.80078ZM17.0008 6.76561L21.2352 11H17.0008V6.76561ZM12.2008 8.59999H13.0008V9.43436C14.252 9.63596 14.6008 10.7712 14.6008 11.4H14.2008L13.8008 11.4023C13.7984 11.2015 13.73 10.2 12.6008 10.2C11.4744 10.2 11.4036 11.0845 11.4008 11.2617C11.4008 11.9461 11.9862 12.1991 12.9406 12.5547C13.8586 12.8967 15.0008 13.322 15.0008 14.6C15.0008 15.24 14.5688 16.4058 13.0008 16.5766V17.4H12.2008V16.5719C10.6328 16.3671 10.2008 14.968 10.2008 14.2H11.0008C11.0024 14.362 11.0596 15.8 12.6008 15.8C14.1824 15.8 14.2008 14.6492 14.2008 14.6C14.2008 13.9128 13.6153 13.6603 12.6609 13.3047C11.7429 12.9627 10.6008 12.5366 10.6008 11.2586C10.6008 10.6742 10.9496 9.61922 12.2008 9.43202V8.59999ZM21.8008 17.4C20.989 17.4 20.2541 17.5138 19.6867 17.7164C19.403 17.8177 19.1591 17.9395 18.9625 18.1055C18.7934 18.2483 18.6546 18.4478 18.6172 18.6844C18.6061 18.7219 18.6006 18.7609 18.6008 18.8V19.4398C18.5088 19.3966 18.4176 19.3531 18.3148 19.3164C17.7475 19.1138 17.0126 19 16.2008 19C15.389 19 14.6541 19.1138 14.0867 19.3164C13.803 19.4177 13.5591 19.5395 13.3625 19.7055C13.1934 19.8483 13.0546 20.0478 13.0172 20.2844C13.0061 20.3219 13.0006 20.3609 13.0008 20.4V23.6C13.0008 23.8894 13.1659 24.1285 13.3625 24.2945C13.5591 24.4605 13.803 24.5823 14.0867 24.6836C14.6541 24.8862 15.389 25 16.2008 25C17.0126 25 17.7474 24.8862 18.3148 24.6836C18.5811 24.5885 18.8109 24.4742 19.0008 24.3234C19.1907 24.4742 19.4205 24.5885 19.6867 24.6836C20.2541 24.8862 20.989 25 21.8008 25C22.6126 25 23.3474 24.8862 23.9148 24.6836C24.1985 24.5823 24.4425 24.4605 24.6391 24.2945C24.8356 24.1285 25.0008 23.8894 25.0008 23.6V22V20.4V18.8C25.0013 18.7598 24.9958 18.7198 24.9844 18.6812V18.6805C24.946 18.4456 24.8073 18.2475 24.6391 18.1055C24.4425 17.9395 24.1985 17.8177 23.9148 17.7164C23.3475 17.5138 22.6126 17.4 21.8008 17.4ZM21.8008 18.2C22.5354 18.2 23.2001 18.3102 23.6461 18.4695C23.8691 18.5492 24.0359 18.6431 24.1227 18.7164C24.2095 18.7897 24.2008 18.8132 24.2008 18.8C24.2008 18.7867 24.2095 18.8103 24.1227 18.8836C24.0359 18.9569 23.8691 19.0508 23.6461 19.1305C23.2001 19.2897 22.5354 19.4 21.8008 19.4C21.0662 19.4 20.4015 19.2897 19.9555 19.1305C19.7325 19.0508 19.5657 18.9569 19.4789 18.8836C19.3921 18.8103 19.4008 18.7867 19.4008 18.8C19.4008 18.8132 19.3921 18.7897 19.4789 18.7164C19.5657 18.6431 19.7325 18.5492 19.9555 18.4695C20.4015 18.3102 21.0662 18.2 21.8008 18.2ZM19.4008 19.7601C19.4928 19.8034 19.5839 19.8469 19.6867 19.8836C20.2541 20.0862 20.989 20.2 21.8008 20.2C22.6126 20.2 23.3475 20.0862 23.9148 19.8836C24.0176 19.8469 24.1088 19.8034 24.2008 19.7601V20.4C24.2008 20.3868 24.2095 20.4103 24.1227 20.4836C24.0359 20.5569 23.8691 20.6508 23.6461 20.7305C23.2001 20.8897 22.5354 21 21.8008 21C21.0662 21 20.4015 20.8897 19.9555 20.7305C19.7325 20.6508 19.5657 20.5569 19.4789 20.4836C19.3921 20.4103 19.4008 20.3868 19.4008 20.4V19.7601ZM16.2008 19.8C16.9354 19.8 17.6001 19.9102 18.0461 20.0695C18.2691 20.1492 18.4359 20.2431 18.5227 20.3164C18.6095 20.3897 18.6008 20.4132 18.6008 20.4C18.6008 20.3867 18.6095 20.4103 18.5227 20.4836C18.4359 20.5569 18.2691 20.6508 18.0461 20.7305C17.6001 20.8897 16.9354 21 16.2008 21C15.4662 21 14.8015 20.8897 14.3555 20.7305C14.1325 20.6508 13.9657 20.5569 13.8789 20.4836C13.7921 20.4103 13.8008 20.3867 13.8008 20.4C13.8008 20.4132 13.7921 20.3897 13.8789 20.3164C13.9657 20.2431 14.1325 20.1492 14.3555 20.0695C14.8015 19.9102 15.4662 19.8 16.2008 19.8ZM13.8008 21.3601C13.8928 21.4034 13.9839 21.4469 14.0867 21.4836C14.6541 21.6862 15.389 21.8 16.2008 21.8C17.0126 21.8 17.7475 21.6862 18.3148 21.4836C18.4176 21.4469 18.5088 21.4034 18.6008 21.3601V22C18.6008 21.9868 18.6095 22.0103 18.5227 22.0836C18.4359 22.1569 18.2691 22.2508 18.0461 22.3305C17.6001 22.4897 16.9354 22.6 16.2008 22.6C15.4662 22.6 14.8015 22.4897 14.3555 22.3305C14.1325 22.2508 13.9657 22.1569 13.8789 22.0836C13.7921 22.0103 13.8008 21.9868 13.8008 22V21.3601ZM19.4008 21.3601C19.4928 21.4034 19.5839 21.4469 19.6867 21.4836C20.2541 21.6862 20.989 21.8 21.8008 21.8C22.6126 21.8 23.3474 21.6862 23.9148 21.4836C24.0177 21.4469 24.1088 21.4034 24.2008 21.3601V22C24.2008 21.9868 24.2095 22.0103 24.1227 22.0836C24.0359 22.1569 23.8691 22.2508 23.6461 22.3305C23.2001 22.4897 22.5354 22.6 21.8008 22.6C21.0662 22.6 20.4015 22.4897 19.9555 22.3305C19.7325 22.2508 19.5657 22.1569 19.4789 22.0836C19.3921 22.0103 19.4008 21.9868 19.4008 22V21.3601ZM13.8008 22.9601C13.8928 23.0034 13.9839 23.0469 14.0867 23.0836C14.6541 23.2862 15.389 23.4 16.2008 23.4C17.0126 23.4 17.7474 23.2862 18.3148 23.0836C18.4177 23.0469 18.5088 23.0034 18.6008 22.9601V23.6C18.6008 23.5868 18.6095 23.6103 18.5227 23.6836C18.4359 23.7569 18.2691 23.8508 18.0461 23.9305C17.6001 24.0897 16.9354 24.2 16.2008 24.2C15.4662 24.2 14.8015 24.0897 14.3555 23.9305C14.1325 23.8508 13.9657 23.7569 13.8789 23.6836C13.7921 23.6103 13.8008 23.5868 13.8008 23.6V22.9601ZM19.4008 22.9601C19.4928 23.0034 19.5839 23.0469 19.6867 23.0836C20.2541 23.2862 20.989 23.4 21.8008 23.4C22.6126 23.4 23.3474 23.2862 23.9148 23.0836C24.0177 23.0469 24.1088 23.0034 24.2008 22.9601V23.6C24.2008 23.5868 24.2095 23.6103 24.1227 23.6836C24.0359 23.7569 23.8691 23.8508 23.6461 23.9305C23.2001 24.0897 22.5354 24.2 21.8008 24.2C21.0662 24.2 20.4015 24.0897 19.9555 23.9305C19.7325 23.8508 19.5657 23.7569 19.4789 23.6836C19.3921 23.6103 19.4008 23.5868 19.4008 23.6V22.9601Z"
                        fill="#4E0F8A"
                      />
                    </g>
                  </g>
                  <defs>
                    <clipPath id="clip0_1692_14495">
                      <rect width="30" height="30" fill="white" />
                    </clipPath>
                    <clipPath id="clip1_1692_14495">
                      <rect
                        width="20"
                        height="20"
                        fill="white"
                        transform="translate(5 5)"
                      />
                    </clipPath>
                  </defs>
                </svg>
              </div>

              <div className={styles.table_data_item_main_date_text}>
                15.06. <span className={styles.gray_text}>2023</span>
              </div>
            </div>
            <div>ООО “Компания”</div>
            <div>10 000 000 000,00 UZS</div>
            <div>Фамилия И.О.</div>
            <div className={styles.table_data_item_main_actions}>
              <div className={styles.status_text}>
                <span></span>Создан
              </div>
              <div onClick={() => setActiveRow(1)}>
                <svg
                  width="15"
                  height="15"
                  viewBox="0 0 15 15"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M2.70039 5.70001C1.70781 5.70001 0.900391 6.50743 0.900391 7.50001C0.900391 8.49259 1.70781 9.30001 2.70039 9.30001C3.69297 9.30001 4.50039 8.49259 4.50039 7.50001C4.50039 6.50743 3.69297 5.70001 2.70039 5.70001ZM7.50039 5.70001C6.50781 5.70001 5.70039 6.50743 5.70039 7.50001C5.70039 8.49259 6.50781 9.30001 7.50039 9.30001C8.49297 9.30001 9.30039 8.49259 9.30039 7.50001C9.30039 6.50743 8.49297 5.70001 7.50039 5.70001ZM12.3004 5.70001C11.3078 5.70001 10.5004 6.50743 10.5004 7.50001C10.5004 8.49259 11.3078 9.30001 12.3004 9.30001C13.293 9.30001 14.1004 8.49259 14.1004 7.50001C14.1004 6.50743 13.293 5.70001 12.3004 5.70001Z"
                    fill="#A5A1A1"
                  />
                </svg>
              </div>
            </div>
          </div>
          {activeRow != "empty" && activeRow == 1 && (
            <div className={styles.table_data_item_accordion}>
              Accordion data
            </div>
          )}
        </div>
        <div
          className={`${styles.table_data_item} ${
            activeRow == 2 && styles.table_data_item_active
          }`}
        >
          <div className={styles.table_data_item_main}>
            <div className={styles.table_data_item_main_date}>
              <div className={styles.table_data_item_main_date_icon}>
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 30 30"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clipPath="url(#clip0_1692_17251)">
                    <rect
                      width="30"
                      height="30"
                      rx="15"
                      fill="#EEEEEE"
                      fillOpacity="0.6"
                    />
                    <path
                      d="M7.80078 6.20001V24.6H18.9852C17.9852 23.672 16.8212 22.132 16.3852 19.8H11.0008V19H16.2648C16.2248 18.62 16.2008 18.22 16.2008 17.8V17.4H11.0008V16.6H17.2289C18.1969 16.384 18.7128 16.1482 19.1648 15.9242C19.6768 15.6682 20.2128 15.4 21.0008 15.4C21.4768 15.4 21.8608 15.496 22.2008 15.632V11.2399L17.1609 6.20001H7.80078ZM17.0008 7.16017L21.2406 11.4H17.0008V7.16017ZM11.0008 14.2H19.0008V15H11.0008V14.2ZM21.0008 16.2C20.4008 16.2 20.0011 16.4002 19.5211 16.6414C19.0411 16.8826 18.4411 17.1643 17.3211 17.4055L17.0008 17.4859V17.807C17.0008 22.9506 20.6808 24.8391 20.8008 24.9195L21.0008 25L21.2008 24.9203C21.3608 24.8399 25.0008 22.7906 25.0008 17.8078V17.4859L24.6805 17.4055C23.5605 17.1643 22.9605 16.8834 22.4805 16.6422C22.0005 16.401 21.6008 16.2 21.0008 16.2Z"
                      fill="#1AB759"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_1692_17251">
                      <rect width="30" height="30" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
              </div>

              <div className={styles.table_data_item_main_date_text}>
                15.06. <span className={styles.gray_text}>2023</span>
              </div>
            </div>
            <div>ООО “Компания”</div>
            <div>10 000 000 000,00 UZS</div>
            <div>Фамилия И.О.</div>
            <div className={styles.table_data_item_main_actions}>
              <div className={styles.status_text}>
                <span></span>Создан
              </div>
              <div onClick={() => setActiveRow(2)}>
                <svg
                  width="15"
                  height="15"
                  viewBox="0 0 15 15"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M2.70039 5.70001C1.70781 5.70001 0.900391 6.50743 0.900391 7.50001C0.900391 8.49259 1.70781 9.30001 2.70039 9.30001C3.69297 9.30001 4.50039 8.49259 4.50039 7.50001C4.50039 6.50743 3.69297 5.70001 2.70039 5.70001ZM7.50039 5.70001C6.50781 5.70001 5.70039 6.50743 5.70039 7.50001C5.70039 8.49259 6.50781 9.30001 7.50039 9.30001C8.49297 9.30001 9.30039 8.49259 9.30039 7.50001C9.30039 6.50743 8.49297 5.70001 7.50039 5.70001ZM12.3004 5.70001C11.3078 5.70001 10.5004 6.50743 10.5004 7.50001C10.5004 8.49259 11.3078 9.30001 12.3004 9.30001C13.293 9.30001 14.1004 8.49259 14.1004 7.50001C14.1004 6.50743 13.293 5.70001 12.3004 5.70001Z"
                    fill="#A5A1A1"
                  />
                </svg>
              </div>
            </div>
          </div>
          {activeRow != "empty" && activeRow == 2 && (
            <div className={styles.table_data_item_accordion}>
              <div className={styles.table_data_item_accordion_left}>
                <div className={styles.table_data_item_accordion_left_item}>
                  <div
                    className={
                      styles.table_data_item_accordion_left_item_header
                    }
                  >
                    Отправитель
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>
                      Наименование организации
                    </div>
                    <div>ООО “Компания”</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>ИНН</div>
                    <div>12345678911234567892</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>МФО банка</div>
                    <div>01140</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>Банк</div>
                    <div>АКБ “Агробанк”</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>Расчетный счет</div>
                    <div>0000 0000 0000 0000 0000</div>
                  </div>
                </div>
                <div className={styles.table_data_item_accordion_left_item}>
                  <div
                    className={
                      styles.table_data_item_accordion_left_item_header
                    }
                  >
                    Получатель
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>
                      Наименование организации
                    </div>
                    <div>ООО “Компания”</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>ИНН</div>
                    <div>12345678911234567892</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>МФО банка</div>
                    <div>01140</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>Банк</div>
                    <div>АКБ “Агробанк”</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>Расчетный счет</div>
                    <div>0000 0000 0000 0000 0000</div>
                  </div>
                </div>
                <div className={styles.table_data_item_accordion_left_item}>
                  <div
                    className={
                      styles.table_data_item_accordion_left_item_header
                    }
                  >
                    Детали платежа
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>
                    Код назначения
                    </div>
                    <div>08102  Оплата налогов и других обязательных платежей по расчёту  </div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>Сумма</div>
                    <div>100 000 000 000,00 UZS</div>
                  </div>
                  <div
                    className={styles.table_data_item_accordion_left_item_text}
                  >
                    <div className={styles.gray_text}>Дата платежа</div>
                    <div>20.09.2023</div>
                  </div>
                </div>
              </div>
              <div className={styles.table_data_item_accordion_right}>
                <div className={styles.table_data_item_accordion_right_pdf}>
                  <div>ПП  №11902</div>
                  <iframe 
                    src="https://www.africau.edu/images/default/sample.pdf"
                    frameBorder="0"
                  ></iframe>
                </div>
              </div>
            </div>
          )}
        </div>
        <div
          className={`${styles.table_data_item} ${
            activeRow == 3 && styles.table_data_item_active
          }`}
        >
          <div className={styles.table_data_item_main}>
            <div className={styles.table_data_item_main_date}>
              <div className={styles.table_data_item_main_date_icon}>
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 30 30"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clipPath="url(#clip0_1692_14239)">
                    <rect
                      width="30"
                      height="30"
                      rx="15"
                      fill="#EEEEEE"
                      fillOpacity="0.6"
                    />
                    <g clipPath="url(#clip1_1692_14239)">
                      <path
                        d="M7.40039 5.79999V24.2H18.6004C18.8758 24.2 19.1452 24.172 19.4051 24.1187H19.4059C19.5356 24.0921 19.6638 24.0585 19.7887 24.0195C19.8643 23.9959 19.9369 23.9662 20.0105 23.9383C20.2285 24.2126 20.4936 24.4474 20.7988 24.6242H20.7996C21.2116 24.8626 21.6914 25 22.2004 25C23.7419 25 25.0004 23.7415 25.0004 22.2C25.0004 20.7947 23.9531 19.6279 22.6004 19.432V5.79999H7.40039ZM10.6004 9.79999H19.4004V10.6H10.6004V9.79999ZM10.6004 13H11.8004V14.6H10.6004V13ZM12.6004 13H17.0004V14.6H12.6004V13ZM17.8004 13H19.4004V14.6H17.8004V13ZM10.6004 15.4H11.8004V17H10.6004V15.4ZM12.6004 15.4H17.0004V16.5367C16.7185 16.6605 16.455 16.8175 16.2113 17H12.6004V15.4ZM17.8004 15.4H19.4004V16.2805C19.1418 16.2277 18.8743 16.2 18.6004 16.2C18.3265 16.2 18.059 16.2277 17.8004 16.2805V15.4ZM18.6004 17C20.3724 17 21.8004 18.4279 21.8004 20.2C21.8004 21.972 20.3724 23.4 18.6004 23.4C16.8283 23.4 15.4004 21.972 15.4004 20.2C15.4004 18.4279 16.8283 17 18.6004 17ZM10.6004 17.8H11.8004V19.4H10.6004V17.8ZM12.6004 17.8H15.409C15.0575 18.266 14.8017 18.8081 14.6809 19.4H12.6004V17.8ZM17.8285 18.5297L17.5043 20.3469H18.1051C18.1711 20.2557 18.3098 20.0836 18.6074 20.0836C18.7138 20.0836 19.1762 20.1244 19.1762 20.6984C19.1762 20.902 19.0542 21.332 18.6074 21.332C18.1918 21.332 18.0832 20.9891 18.0676 20.8391H17.4012C17.3948 21.2339 17.6787 21.8766 18.6215 21.8766C19.5171 21.8766 19.8418 21.1312 19.8418 20.6984C19.8418 20.4712 19.7221 19.5812 18.8277 19.5812C18.4497 19.5812 18.2752 19.7443 18.1848 19.8351L18.1754 19.825L18.3066 19.0797H19.6637V18.5297H17.8285ZM22.598 20.2398C23.5149 20.4229 24.2004 21.2273 24.2004 22.2C24.2004 23.3089 23.3093 24.2 22.2004 24.2C21.8345 24.2 21.4947 24.1022 21.2004 23.932H21.1996C21.0309 23.8342 20.8795 23.7106 20.7465 23.5695C20.7755 23.551 20.8063 23.5349 20.8348 23.5156H20.8355C20.9418 23.4437 21.0447 23.3666 21.1434 23.2851C21.341 23.122 21.5224 22.9398 21.6855 22.7422C21.767 22.6435 21.8441 22.5414 21.916 22.4351V22.4344C21.988 22.3279 22.0551 22.218 22.1168 22.1047C22.1784 21.9913 22.2349 21.8743 22.2855 21.7547C22.3361 21.6353 22.3809 21.5132 22.4199 21.3883V21.3875C22.4589 21.2626 22.4925 21.1352 22.5191 21.0055V21.0047C22.5698 20.7575 22.5955 20.5012 22.598 20.2398Z"
                        fill="#A5A1A1"
                      />
                    </g>
                  </g>
                  <defs>
                    <clipPath id="clip0_1692_14239">
                      <rect width="30" height="30" fill="white" />
                    </clipPath>
                    <clipPath id="clip1_1692_14239">
                      <rect
                        width="20"
                        height="20"
                        fill="white"
                        transform="translate(5 5)"
                      />
                    </clipPath>
                  </defs>
                </svg>
              </div>

              <div className={styles.table_data_item_main_date_text}>
                15.06. <span className={styles.gray_text}>2023</span>
              </div>
            </div>
            <div>ООО “Компания”</div>
            <div>10 000 000 000,00 UZS</div>
            <div>Фамилия И.О.</div>
            <div className={styles.table_data_item_main_actions}>
              <div className={styles.status_text}>
                <span></span>Создан
              </div>
              <div onClick={() => setActiveRow(3)}>
                <svg
                  width="15"
                  height="15"
                  viewBox="0 0 15 15"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M2.70039 5.70001C1.70781 5.70001 0.900391 6.50743 0.900391 7.50001C0.900391 8.49259 1.70781 9.30001 2.70039 9.30001C3.69297 9.30001 4.50039 8.49259 4.50039 7.50001C4.50039 6.50743 3.69297 5.70001 2.70039 5.70001ZM7.50039 5.70001C6.50781 5.70001 5.70039 6.50743 5.70039 7.50001C5.70039 8.49259 6.50781 9.30001 7.50039 9.30001C8.49297 9.30001 9.30039 8.49259 9.30039 7.50001C9.30039 6.50743 8.49297 5.70001 7.50039 5.70001ZM12.3004 5.70001C11.3078 5.70001 10.5004 6.50743 10.5004 7.50001C10.5004 8.49259 11.3078 9.30001 12.3004 9.30001C13.293 9.30001 14.1004 8.49259 14.1004 7.50001C14.1004 6.50743 13.293 5.70001 12.3004 5.70001Z"
                    fill="#A5A1A1"
                  />
                </svg>
              </div>
            </div>
          </div>
          {activeRow != "empty" && activeRow == 3 && (
            <div className={styles.table_data_item_accordion}>
              Accordion data
            </div>
          )}
        </div>
      </div>
    </div>
  );
}
